Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Set when matching failed due to an internal error.
ja: マッチングが内部エラーのために失敗した時に設定されます。

source: Set when the Block is called after matching has completed.
ja: マッチングが完了した後「ブロック」が呼ばれる時に設定されます。

source: Set when the Block is called to report progress during a long-running match operation.
ja: 長く実行されているマッチ操作の間、「ブロック」が経過報告のために呼ばれる時に設定されます。

source: Set when the current match depended on the location of the end of the search range.
ja: 現在のマッチが検索範囲の終端箇所に依存している時に設定されます。

source: Set when the current match operation reached the end of the search range.
ja: 現在のマッチ操作が検索範囲の終わりに達した時に設定されます。

source: Sets
ja: 集合

source: Sets a region of the data buffer to 0.
ja: あるデータバッファの領域を0に設定します。

source: Sets the attributes of the specified file or directory.
ja: 指定されたファイルまたはディレクトリの属性を設定します。

source: Sets the current transformation matrix to the receiver’s transformation matrix.
ja: 現在の変換行列をレシーバの変換行列に設定します。

source: Sets the date format from a template using the specified locale for the receiver.
ja: レシーバに対して指定されたロケールを使って、日付書式設定を雛形から設定します。

source: Sets the default formatting behavior for instances of the class.
ja: クラスのインスタンスに対する省略時の書式設定挙動を設定します。

source: Sets the receiver's version number.
ja: レシーバのバージョンナンバーを設定します。

source: Sets the top-level error-handling function where you can perform last-minute logging before the program terminates.
ja: トップレベルのエラー処理関数を設定します、そこにおいてあなたはプログラムを終わらせる前に最後の瞬間のログを実行できます。

source: Sets the value of the specified attribute in the receiver to the specified value.
ja: レシーバにおいて指定された属性の値を指定された値に設定します。

source: Sets the value to a union of the Character Set with another Character Set.
ja: 値をこのCharacter Setと別のCharacter Setの和集合に設定します。

source: Sets the value to an exclusive or of the Character Set with another Character Set.
ja: 値をこのCharacter Setと別のCharacter Setの排他的論理和に設定します。

source: Sets the value to an intersection of the Character Set with another Character Set.
ja: 値をこのCharacter Setと別のCharacter Setの交差に設定します。

source: Sets whether the item at the specified URL should be stored in the cloud.
ja: 指定されたURLでの項目がクラウドに格納されるべきかどうかを設定します。

source: Setting Formatting Styles
ja: 書式形式を設定する

source: Setting a component to something which would be inconsistent forces other components to change; for example, setting the Weekday to Thursday probably shifts the Day and possibly Month and Year.
ja: ある構成要素を調和しない何か設定することは他の構成要素に変化を強要するでしょう；例えば、「週」を「火曜日」に設定することはおそらくは「日」そしてもしかしたら「月」と「年」をずらします。

source: Setting and Building the Current Transformation Matrix
ja: 現在の変換行列の設定と組み立て

source: Setting the value of this property to true adds phrasing to output strings to reflect that the given time value is approximate and not exact.
ja: このプロパティの値をtrueに設定することは、与えられた時間値が概算で正確でないことを反映するために、言い回しを出力文字列に加えます。

source: Setting this property to true results in output strings like “30 minutes remaining”.
ja: このプロパティの値をtrueに設定することは、“30 minutes remaining” のような出力文字列という結果になります。

source: Setting this property to nil causes the formatter to use the Gregorian calendar with the en_US_POSIX locale.
ja: このプロパティをnilに設定することは、フォーマッタにグレゴリオ暦をen_US_POSIXロケールとともに使わせます。

source: Setting this value to false and allowed Units to false results in an empty string.
ja: この値をfalseにそしてallowed Unitsをfalseに設定することは、空の文字列という結果になります。

source: Setting this value to false and includes Count to false results in an empty string.
ja: この値をfalseにそしてincludes Countをfalseに設定することは、空の文字列という結果になります。

source: Setting this value to true causes the byte count to be displayed parenthetically (localized as appropriate), for instance 723 KB (722,842 bytes).
ja: この値をtrueに設定することは、バイト計数が挿入句として表示されるようにします（適切にローカライズされて）、例えば723 KB (722,842 bytes)。

source: Several Calendar APIs use either a single unit or a set of units as input to a search algorithm.
ja: いくつかのCalendar APIは、単一のカレンダー単位または一揃いにした複数単位のどちらかを検索アリゴリズムへの入力として使います。

source: Shared Files
ja: 共有ファイル

source: Shifting Index Groups
ja: インデックスグループをずらす

source: Should an error occur when compiling or executing the script, several of the methods return a dictionary containing error information.
ja: スクリプトのコンパイルまたは実行のときエラーが起こるならば、いくつかのメソッドはエラー情報を含んでいる辞書を返します。

source: Similarly for DST backwards jumps which repeats times, you’ll get the first match by default, where “first” is defined from the point of view of searching forwards.
ja: 同様に時間に繰り返すDST後方ジャンプに対して、あなたは最初の合致するものを初期状態で得ます、ここで “最初” は前方に検索する観点から定義されます。

source: Similarly, for string resources, you use NSLocalized String to load individual strings instead of loading the entire .strings file yourself.
ja: 同様に、文字列リソースに対して、あなたはNSLocalized Stringを使って個々の文字列をロードします、あなた自身で.stringsファイル全体をロードする代わりに。

source: Similarly, if a file wrapper represents an image file, you can display the image directly rather than a file icon.
ja: 同様に、ファイルラッパーが画像ファイルを表すならば、あなたはファイルアイコンではなく、その画像を直接に表示できます。

source: Similarly, if you omit a specific attribute, the default value is used.
ja: 同じように、あなたが特定の属性を省くならば、省略時の値が使用されます。

source: Similarly, your code should not attempt to access any symbols defined in an unloaded bundle.
ja: 同様に、あなたのコードは、アンロードされたバンドルの中で定義される何らかのシンボルにアクセスするのを試みるべきではありません。

source: Simply calls NSLogv, passing it a variable number of arguments.
ja: 単純にNSLogvを呼び出します、それに可変数の引数を渡します。

source: Skipping Subdirectories
ja: 下位ディレクトリをスキップする

source: Snake-case and camel-case are two common approaches for combining words when naming parts of an API.
ja: スネークケースとキャメルケースは、APIの部品に名前を付ける場合に単語を結合するための２つの一般的な取り組み方です。

source: So for an app, the main bundle object gives you access to the resources that shipped with your app.
ja: なのであるアプリに対して、メインバンドルオブジェクトは、あなたにあなたのアプリに積み込まれるリソースへのアクセスを与えます。

source: So for the “set to Thursday” example, find the Thursday in the Week in which the given date resides (which could be a forwards or backwards move, and not necessarily the nearest Thursday).
ja: それで “set to Thursday” 例に対して、与えられた日付が在する「週」の中に「火曜日」を見つけます（それは未来または過去に移動できます、そして必ずしも最も近い「火曜日」ではありません）。

source: So, for example, you might use an instance of NSApple Event Descriptor to assemble an Apple event and call the Apple Event Manager function AESend(_:_:_:_:_:_:_:) to send it.
ja: それで、例えば、あなたはNSApple Event Descriptorのインスタンスを使ってアップルイベントをまとめ上げて、それを送るためにアップルイベントマネージャ関数AESend(_:_:_:_:_:_:_:)を呼び出すことができます。

source: So, if you evaluate the specifier and there are no objects that match, you should return an empty array, not nil.
ja: それで、あなたが指定子を評価して合致するオブジェクトが全くないならば、あなたは空の配列を返すべきです、nilではなく。

source: So, when searching backwards looking for a particular hour, with no minute and second specified, you don’t get a minute and second of 59:59 for the matching hour (which would be the nominal first match within a given hour, given the other rules here, when searching backwards).
ja: それで、分と秒を指定しないで、特定の一時間を見つけるために後方に検索する場合、あなたは合致する一時間に対して59:59の分と秒を得ません（それは後方に検索する場合、ここで与えられた他の規則の、与えられた一時間内の名目上の最初の合致でしょう）。

source: Socket
ja: ソケット

source: Sockets
ja: さまざまなソケット

source: Some JSON APIs adopt snake-case; use this strategy when you encounter such an API.
ja: いくつかのJSON APIはスネークケースを採用します；あなたがそのようなAPIに出くわす場合はこの戦略を使ってください。

source: Some common word delimiting punctuation isn’t considered, so this property may not generally produce the desired results for multiword strings.
ja: 幾つかのよくある単語区切り約物は考慮されません、それでこのプロパティは２語以上からなる文字列に対して望ましい結果を大抵は生み出しません。

source: Some computations can take a relatively long time.
ja: いくつかの計算は、相対的に長い時間がかかることがあります。

source: Some of the keys, such as hfs Creator Code and hfs Type Code, do not apply to directories.
ja: キーのいくつか、例えばhfs Creator Codeやhfs Type Codeなどは、ディレクトリに適用されません。

source: Some of the keys, such as NSFile HFSCreator Code and NSFile HFSType Code, do not apply to directories.
ja: キーのいくつか、 例えばNSFile HFSCreator CodeとNSFile HFSType Codeなどは、ディレクトリに適用されません。

source: Some regular expressions (though not the example pattern) can successfully match a zero-length range, so the comparison of the resulting range with {NSNot Found, 0} is the most reliable way to determine whether there was a match or not.
ja: 若干の正規表現は（例パターンはそうでないけれども）成功裏にゼロ長の範囲にマッチすることができるので、結果として生じる範囲を{NSNot Found, 0}と比較することは、マッチがあったかどうか判定する最も信頼できる方法です。

source: Some types of frequently used resources can be located and opened without a bundle.
ja: いくつかの型のよく使われるリソースは、バンドルなしで発見され開かれることが可能です。

source: Sometimes there may be another class which may work nearly as well as a substitute for the new class, and the archive keys and archived state for the new class can be carefully chosen (or compatibility written out) so that the object can be unarchived as the substitute class if necessary.
ja: 時には別のクラスが存在するかもしれません、それはおおよそその新しいクラスの代用として機能するかもしれません、そのため新しいクラスに対するアーカイブキーとアーカイブ状態は、綿密に選択される（または互換性が細大漏らさず書かれる）ことができます、それによって必要ならばそのオブジェクトが代用クラスとしてアンアーカイブされることができます。

source: Somewhat more efficient than capturing parentheses.
ja: 捕獲する括弧よりいくぶん効率的なもの。

source: Sorting
ja: ソートする

source: Sorting Bytes
ja: バイトをソートする

source: Sorting Elements
ja: 要素のソート（並べ換え）

source: Sorting Indexes
ja: インデックスをソートする

source: Sorting Nodes
ja: ノードをソートする

source: Sorts the collection in place, using the given predicate as the comparison between elements.
ja: コレクションをその場でソートします、与えられた述部を要素間の比較として使います。

source: Sorts the collection in place.
ja: コレクションをその場でソートします。

source: Sound resources are those files in the bundle that are recognized by the NSSound class.
ja: サウンドリソースは、NSSoundクラスによって認識されるような種類の、バンドルの中のファイルです。

source: Special Considerations
ja: 特別な注意事項

source: Special Semantic Values
ja: 特別な意味論の値

source: Special handling of certain values such as zero is especially important in some languages, so it's highly recommended that this property be left in its default state.
ja: ゼロのような若干の値の特別処理は、幾つかの言語においてとりわけ重要です、なのでこのプロパティがその省略時の状態のままに置かれることは大いに推奨されます。

source: Specialized Sets
ja: 特殊化された集合

source: Specifies a full style with complete details, such as “Tuesday, April 12, 1952 AD” or “3:30:42 PM Pacific Standard Time”.
ja: 完全なスタイル、完璧な詳細を持つ、例えば “Tuesday, April 12, 1952 AD” や “3:30:42 PM Pacific Standard Time” など。

source: Specifies a long style, typically with full text, such as “November 23, 1937” or “3:30:32 PM PST”.
ja: 長いスタイルを指定します、大抵は完全なテキストを持つ、例えば “November 23, 1937” や “3:30:32 PM PST” など。

source: Specifies a long unit style.
ja: 長い単位形式を指定します。

source: Specifies a medium style, typically with abbreviated text, such as “Nov 23, 1937” or “3:30:32 PM”.
ja: 中庸なスタイルを指定します、大抵は省略テキストを持つ、例えば “Nov 23, 1937” や “3:30:32 PM” など。

source: Specifies a medium unit style.
ja: 中くらいの単位形式を指定します。

source: Specifies a short style, typically numeric only, such as “11/23/37” or “3:30 PM”.
ja: 短いスタイルを指定します、大抵は数字だけ、例えば “11/23/37” や “3:30 PM” など。

source: Specifies a short unit style.
ja: 短い単位形式を指定します。

source: Specifies a strong reference to the associated object, and that the association is made atomically.
ja: 連想オブジェクトへの強い参照、そして連想が自動的に作られることを指定します。

source: Specifies a strong reference to the associated object, and that the association is not made atomically.
ja: 連想オブジェクトへの強い参照、そして連想が自動的に作られないことを指定します。

source: Specifies a weak reference to the associated object.
ja: 連想オブジェクトに対する弱い参照を指定します。

source: Specifies an undetermined format.
ja: 未定の書式を指定します。

source: Specifies default formatting behavior.
ja: 省略時の書式設定挙動を指定します。

source: Specifies display of file byte counts.
ja: ファイルバイト計数の表示を指定します。

source: Specifies display of file or storage byte counts.
ja: ファイルまたはストレージのバイト計数の表示を指定します。

source: Specifies display of memory byte counts.
ja: メモリバイト計数の表示を指定します。

source: Specifies formatting behavior equivalent for OS X 10.4.
ja: OS X 10.4に同等の書式設定挙動を指定します。

source: Specifies formatting behavior equivalent to that in OS X 10.0.
ja: OS X 10.0に同等の書式設定挙動を指定します。

source: Specifies formatting for a list or menu.
ja: リストまたはメニューに対して書式設定することを指定します。

source: Specifies formatting for the beginning of a sentence.
ja: ある文の始まりに対して書式設定することを指定します。

source: Specifies formatting for the beginning of a sentences.
ja: 文の始まりに対して書式設定することを指定します。

source: Specifies formatting for the middle of a sentence.
ja: ある文の中心に対して書式設定することを指定します。

source: Specifies how the notification is posted to the task and when to deliver it to its observers.
ja: どのように通知がタスクに対して投函されるかそして何時それをそのオブザーバに配達するかを指定します。

source: Specifies no style.
ja: スタイルなしを指定します。

source: Specifies that ^ and $ will not automatically match the beginning and end of the search range, but will still match the beginning and end of the entire string.
ja: ^と$が自動的には検索範囲の始まりと終わりにマッチしないこと、しかし依然として文字列全体の始まりと終わりにマッチすることを示します。

source: Specifies that alignment of the height should be to the nearest integral value.
ja: 高さの調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the height should be to the nearest inward integral value.
ja: 高さの調整が最も近い内側の整数値でなければならないことを指定します。

source: Specifies that alignment of the height should be to the nearest outward integral value.
ja: 高さの調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that alignment of the maximum X coordinate should be to the nearest integral value.
ja: 最大限のX座標の調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the maximum X coordinate should be to the nearest inward integral value.
ja: 最大限のX座標の調整が最も近い内側の整数値でなければならないことを指定します。

source: Specifies that alignment of the maximum X coordinate should be to the nearest outward integral value.
ja: 最大限のX座標の調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that alignment of the maximum Y coordinate should be to the nearest integral value.
ja: 最大限のY座標の調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the maximum Y coordinate should be to the nearest outward integral value.
ja: 最大限のY座標の調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum X coordinate should be to the nearest integral value.
ja: 最小限のX座標の調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum X coordinate should be to the nearest inward integral value.
ja: 最小限のX座標の調整が最も近い内側の整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum X coordinate should be to the nearest outward integral value.
ja: 最小限のX座標の調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum Y coordinate should be to the nearest integral value.
ja: 最小限のY座標の調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum Y coordinate should be to the nearest inward integral value.
ja: 最小限のY座標の調整が最も近い内側の整数値でなければならないことを指定します。

source: Specifies that alignment of the minimum Y coordinate should be to the nearest outward integral value.
ja: 最小限のY座標の調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that alignment of the width should be to the nearest integral value.
ja: 幅の調整が最も近い整数値でなければならないことを指定します。

source: Specifies that alignment of the width should be to the nearest inward integral value.
ja: 幅の調整が最も近い内側の整数値でなければならないことを指定します。

source: Specifies that alignment of the width should be to the nearest outward integral value.
ja: 幅の調整が最も近い外側の整数値でなければならないことを指定します。

source: Specifies that an event-processing operation should continue until a timeout occurs based on a value determined by the Apple Event Manager (about 1 minute).
ja: あるイベント処理操作が、アップルイベントマネージャによって決められる値（およそ１分）に基づいて時間切が起こるまで続けられるべきであるのを指定します。

source: Specifies that an object no longer wants to receive certain notifications.
ja: あるオブジェクトがもはや特定の通知の受け取りを望まないことを指定します。

source: Specifies that matches are limited to those at the start of the search range.
ja: マッチが検索範囲の始まりでのものに限定されることを示します。

source: Specifies that matching may examine parts of the string beyond the bounds of the search range, for purposes such as word boundary detection, lookahead, etc.
ja: 語境界検出、先読み検索、などのような目的のために、マッチングが検索範囲の境界を越える文字列の一部かどうかを調べるように指定します。

source: Specifies that the application is willing to wait indefinitely for the current operation to complete.
ja: アプリケーションが現在の操作を完了するために無限に待つ用意があることを指定します。

source: Specifies that the associated object is copied, and that the association is made atomically.
ja: 連想オブジェクトがコピーされること、そして連想が自動的に作られることを指定します。

source: Specifies that the associated object is copied, and that the association is not made atomically.
ja: 連想オブジェクトがコピーされること、そして連想が自動的に作られないことを指定します。

source: Specifies that the number of digits allowed after the decimal separator in a decimal number should not be limited.
ja: 10進数の中の小数点の後に許される桁数が制限されるべきであるのを指定します。

source: Specifies the behavior when multiple matches are found.
ja: 複数の合致するものが見つけられる場合の挙動を指定します。

source: Specifies the capitalization context to be used is unknown.
ja: 使用される大文字使用の文脈が不明であることを指定します。

source: Specifies the capitalization context.
ja: 大文字使用の文脈を指定します。

source: Specifies the contents of the object to be created.
ja: 作成されるオブジェクトの内容を指定します。

source: Specifies the direction in time to search.
ja: 時間での、検索する方向を指定します。

source: Specifies the mechanism to free the indicated buffer, or .none.
ja: 指し示されたバッファを自由にする仕組み、または.noneを指定します。

source: Specifies the technique the search algorithm uses to find results.
ja: 検索アルゴリズムが結果を見つけるために使うテクニックを指定します。

source: Specifies the units appropriate for the formatter to display.
ja: フォーマッタが表示するのに適切な単位を指定します。

source: Specifies the values that can be associated with the protection Key key.
ja: protection Keyキーと結びつけることが可能な値を指定します。

source: Specifies the width of the unit, determining the textual representation.
ja: テキスト表現を判断して、単位の幅を指定します。

source: Specifies when to deliver the notification.
ja: いつ通知を配達するかを指定します。

source: Specify 0 for this parameter if you want the file manager to choose the domain that is most appropriate for the specified url.
ja: 0をこのパラメータに対して指定してください、もしあなたが指定されたurlに対して最も適切である領域を選ぶために、ファイルマネージャを望むならば。

source: Specify nil for this parameter if there is no earlier version of the contents or if you want to ensure that all the contents are written to files.
ja: nilをこのパラメータに指定してください、もしより前のバージョンの内容はないならば、または全ての内容がファイルに書き出されることをあなたが確信したいならば。

source: Specify true for flipped if the underlying view uses a flipped coordinate system.
ja: trueをflippedに指定してください、もし基底ビューが反転座標システムを使うならば。

source: Specify true to move the item to iCloud or false to remove it from iCloud (if it is there currently).
ja: trueをiCloudに項目を移動するために、もしくはfalseをiCloudからそれを除去するために（それが現在あるならば）指定してください。

source: Specify a notification name to remove only entries that specify this notification name.
ja: 通知の名前を指定してください、この通知名を指定する登録項目のみ除去します。

source: Specify a notification sender to remove only entries that specify this sender.
ja: 通知の送り手を指定してください、この送り手を指定する登録項目のみ除去します。

source: Specify an observer to remove only entries for this observer.
ja: このオブザーバに対する登録項目のみ除去するオブザーバを指定してください。

source: Specify the URL for the file or directory in the cloud that you want to download.
ja: あなたがダウンロードを望むクラウドでのファイルまたはディレクトリのURLを指定してください。

source: Specify the URL for the file or directory whose status you want to check.
ja: 状態をあなたが確認したいファイルまたはディレクトリに対するURLを指定してください。

source: Specify the URL of the item (file or directory) that you want to store in iCloud.
ja: あなたがiCloudに格納したい項目（ファイルまたはディレクトリ）のURLを指定してください。

source: Specify the URL of the item in the cloud that you want to share.
ja: クラウドにおける項目で、あなたが共有を望むもののURLを指定してください。

source: Specify the URL to a file or directory in iCloud storage.
ja: iCloudストレージの中のファイルまたはディレクトリに対するURLを指定してください。

source: Specify the formatting context for the formatted string.
ja: 書式設定される文字列に対する書式設定文脈を指定します。

source: Specify the the number of bytes to be used for kilobytes.
ja: キロバイトとして使われるバイト数を指定します。

source: Specify the units that can be used in the output.
ja: 出力において使用されることができる単位を指定します。

source: Specifying case Insensitive means that matches will be case-insensitive, so this will match “BC”, “aD”, and so forth, as well as their lower-case equivalents.
ja: case Insensitiveの指定は、マッチが大文字と小文字の区別をしないことを意味します、それでこれは、“BC”、“aD”、その他にマッチします、それらの小文字の等価物だけではなしに。

source: Specifying a delay of 0 does not necessarily cause the selector to be performed immediately.
ja: 0の猶予を指定することは、必ずしもセレクタが直ちに実行されるようにはしません。

source: Specifying a negative value has the effect of inverting the direction of the axes in addition to scaling them.
ja: 負数の指定は、それらを拡大縮小するだけでなく、軸の方向を逆にする効果を持ちます。

source: Specifying an index of 0 or count + 1 causes appending to the end of the list.
ja: ０または総数＋１のインデックスを指定することはリストの最後に加えることを引き起こします。

source: Specifying any units explicitly causes just those units to be used in showing the number.
ja: なんらかの単位を明示的に指定することは、それら単位だけが数の表示において使われるようにします。

source: Specifying the Script
ja: スクリプトを指定する

source: Spelling and Grammar
ja: スペルと文法

source: Splitting and Joining Ranges
ja: 範囲の分割と結合

source: Splitting the Buffer
ja: バッファを分割する

source: Splitting the Set
ja: 集合を分割する

source: Stand-alone properties are for use in places like calendar headers.
ja: 単独動作型のプロパティは、カレンダーの先頭見出しのような場所での使用のためのものです。

source: Standard Formats
ja: 標準書式設定

source: Starting at range .location, each element of the array is passed as an argument to an is Equal(_:) message sent to an Object until a match is found or the end of the range is reached.
ja: インデックスrange .locationで始めて、配列の中の各要素は、合致するものが見つけられるかrangeの終わりに到達するまで、an Objectへ送られるis Equal(_:)メッセージへ引数として渡されます。

source: Starting at index 0, each element of the array is passed as an argument to an is Equal(_:) message sent to an Object until a match is found or the end of the array is reached.
ja: インデックス0で始めて、配列の中の各要素は、合致するものが見つけられるか配列の終わりに到達するまで、an Objectへ送られるis Equal(_:)メッセージへ引数として渡されます。

source: Starting in macOS 10.4, for backward binary compatibility, if it is overridden, Cocoa invokes the now-deprecated method take Value: for Key: instead of set Value(_: for Key:).
ja: macOS 10.4から、後方バイナリ互換性に対して、それがオーバーライドされるならば、Cocoaは現在非推奨のメソッドtake Value: for Key:をset Value(_: for Key:)の代わりに呼び出します。

source: Starting in macOS 10.7, File Wrapper moved from Application Kit to Foundation.
ja: macOS 10.7からは、File WrapperはApplication KitからFoundationへ移動しました。

source: Starts downloading (if necessary) the specified item to the local system.
ja: 指定された項目をローカルシステムにダウンロードすることを開始します。

source: Stops the observer object from receiving change notifications for the property specified by the key path relative to the object receiving this message, given the context.
ja: オブザーバーオブジェクトが、与えられた文脈で、このメッセージを受け取っているオブジェクトに相対的なキーパスによって指定されるプロパティに関する変更通知を受け取ることを止めます。

source: Stops the observer object from receiving change notifications for the property specified by the key path relative to the object receiving this message.
ja: オブザーバーオブジェクトが、このメッセージを受け取っているオブジェクトに相対的なキーパスによって指定されるプロパティに関する変更通知を受け取ることを止めます。

source: Stores a specified cookie in the cookie storage if the cookie accept policy permits.
ja: 指定されたクッキーをクッキーストレージに格納します、もしクッキー受入方針が許可するならば。

source: Streams
ja: ストリーム

source: Streams, Sockets, and Ports
ja: ストリーム、ソケット、およびポート

source: Strict 7-bit ASCII encoding within 8-bit chars; ASCII values 0…127 only.
ja: 厳密７ビットASCIIエンコーディング、８ビットchar内；ASCII 値 0…127 のみ。

source: String value must be either "TRUE" or "FALSE".
ja: 文字列値は、"TRUE" または "FALSE" のどちらかでなければなりません。

source: Strings
ja: 文字列

source: Strings and Text
ja: 文字列とテキスト

source: Strings in Swift conform to the Comparable protocol, so the names are sorted in ascending order according to the less-than operator (<).
ja: 文字列はSwift ではComparableプロトコルに準拠します、それでこれらの名前はより小さい演算子（<）によって昇順にソートされます。

source: Strings that are used as keys in a userinfo dictionary in a file handle notification.
ja: ファイルハンドル通知の中のuserinfo辞書においてキーとして使われる文字列。

source: Strings with Metadata
ja: メタデータを持つ文字列

source: Structures
ja: 構造体

source: Style
ja: スタイル

source: Styles
ja: スタイル

source: Subclasses of NSInput Stream may return false if this operation is not appropriate for the stream type.
ja: NSInput Streamのサブクラスはfalseを返すかもしれません、もしこの操作がストリーム型に適さないならば。

source: Subclasses to substitute a new class for instances during keyed archiving.
ja: キー付きアーカイブ作成の間にインスタンスに対する新しいクラスの代理を務めるためのサブクラスたち。

source: Subclassing Notes
ja: サブクラス作成の注意

source: Subnormal numbers are often called denormal or denormalized—these are different names for the same concept.
ja: サブノーマル数は、しばしばデノーマルまたはデノーマライズされたと呼ばれます—それらは同じ概念に対する異なる名前です。
